In [13]:
import pandas as pd
import numpy as np

df1 = pd.DataFrame({'Name':['Jtestn','Mike','Smith','Wale','Marry','Tom','Menda','Bolt','Yuswa',],
    'Age':[23,np.nan,12,34,27,44,28,39,40]})
df2 = pd.DataFrame({'Name':['Jtestn','Smith','Wale','Tom','Menda','Yuswa',],
    'Age':[23,12,34,44,28,40]})

In [14]:
df1

    Name   Age
0   Jtestn  23.0
1   Mike   NaN
2  Smith  12.0
3   Wale  34.0
4  Marry  27.0
5    Tom  44.0
6  Menda  28.0
7   Bolt  39.0
8  Yuswa  40.0

In [15]:
df2

    Name  Age
0   Jtestn   23
1  Smith   12
2   Wale   34
3    Tom   44
4  Menda   28
5  Yuswa   40

In [16]:
df_1notin2 = df1[~(df1['Name'].isin(df2['Name']) & df1['Age'].isin(df2['Age']))].reset_index(drop=True)

<b>Implementation one </b>

In [17]:
df_1notin2

    Name   Age
0   Mike   NaN
1  Marry  27.0
2   Bolt  39.0

<b>Implementation two </b>

In [18]:
df1[~df1.apply(tuple,1).isin(df2.apply(tuple,1))]

    Name   Age
1   Mike   NaN
4  Marry  27.0
7   Bolt  39.0